Table of Contents
 Class ArcSegment3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents an arc segment in three-dimensional space.
[OpenModelClass("CI.Geometry3D.ArcSegment3D,CI.Geometry3D", "CI.Geometry3D.IArcSegment3D,CI.BasicTypes")]
public class ArcSegment3D : Segment3D
Inheritance
object
OpenObject
OpenElementId
Segment3D
ArcSegment3D
Inherited Members
 Segment3D.StartPoint
 Segment3D.EndPoint
 Segment3D.LocalCoordinateSystem
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Point
Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
public ReferenceElement Point { get; set; }
Property Value
ReferenceElement
 Edit this page